package references;

public class Assignment {

	/*public static void main(String[] args) {
		// attempt1();
		attempt2();
		// attempt3();

	}*/

	public static void attempt1() {
		// янгдюел назейр х опхябюебюел юдпея
		// назейрю яяшкнвмни оепелеммни у
		// у яндепфхр яяшкйс(юдпея) мю назейр
		String[] x = { "A" };
		// янгдюел яяшкнвмсч оепелеммсч с
		// х опхябюхбюел еи яндепфхлне у
		// рнеярэ яяшкйс мю люяяхб
//!опнхяундхр оепедювю он гмювемхч, гмювемхе у(яяшкйю) опхябюхбюеряъ с!
		String[] y = x;
		// реоепэ дбе яяшкнвмше оепелеммше яндепфюр
		// ндмс х рсфе яяшкйс х пюбмнопюбмш б хглемемхх назейрю
		// ндмю оепелеммюъ бхдхр деиярбхъ дпсцни
		x[0] = "B";
		// y[0]="B";
		// лш хглемхкх !ябниярбн! наейрю
		// мн яяшкнвмше оепелеммше опнднкфючр
		// сйюгшбюрэ мю рнр фе назейр
		System.out.println(x[0] + "  " + y[0]);
		System.out.println((x == y) + "  " + x.equals(y) + "  ");
	}

	public static void attempt2() {
		// янгдюел назейр х опхябюебюел юдпея
		// назейрю яяшкнвмни оепелеммни у
		// у яндепфхр яяшкйс(юдпея) мю назейр
		String x = "A";
		// янгдюел яяшкнвмсч оепелеммсч с
		// х опхябюхбюел еи яндепфхлне у
		// рнеярэ яяшкйс мю леярн б оюлърх цде кефхр "ю"
		// !опнхяундхр оепедювю он гмювемхч, гмювемхе у(яяшкйю) опхябюхбюеряъ с!
		String y = x;
		// реоепэ дбе яяшкнвмше оепелеммше яндепфюр
		// ндмс х рсфе яяшкйс х пюбмнопюбмш 
		//б хглемемхх назейрю(еякх с наейрю еярэ онкъ
		//йнрнпше лнфмн хглемърэ)
		//с щрнцн назейрю рюйху онкеи мер
		//ндмю оепелеммюъ бхдхр деиярбхъ дпсцни
		x = "B";
		//ашк янгдюм мнбши назейр "б", х яяшкйю б оепелеммни у мю
		//опедшдсыхи назейр гюрепкюяэ, х оепелеммни у
		//ашкю опхябнемю мнбюъ яяшкйю мю мнбши назейр
		System.out.println(x + "  " + y);
		System.out.println((x == y) + "  " + x.equals(y) + "  ");
	}

	public static void attempt3() {
		int x = 5;
		int y = x;
		x = 4;
		System.out.println(x + "  " + y);
		System.out.println((x == y) + "  ");
	}
}
